In [10]:
import pandas as pd
pd.set_option('display.max_rows', None)
#pd.set_option('display.max_columns', None)
orders_data = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2022-10-05','2022-09-10','2022-10-05','2022-08-17','2022-09-10','2022-07-27','2022-09-10','2022-10-10','2022-10-10','2022-06-27','2022-08-17','2022-04-25'],
'customer_id':[5001,5001,5005,5001,5005,5001,5005,5001,5005,5001,5005,5005],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})
print("Original Orders DataFrame:")
print(orders_data)
print("\nGroup by two columns and count by each row:")
result = orders_data.groupby(['salesman_id','customer_id']).size().reset_index().groupby(['salesman_id','customer_id'])[[0]].max()
print(result)

Original Orders DataFrame:
    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2022-10-05         5001         5002
1    70009     270.65  2022-09-10         5001         5005
2    70002      65.26  2022-10-05         5005         5001
3    70004     110.50  2022-08-17         5001         5003
4    70007     948.50  2022-09-10         5005         5002
5    70005    2400.60  2022-07-27         5001         5001
6    70008    5760.00  2022-09-10         5005         5001
7    70010    1983.43  2022-10-10         5001         5006
8    70003    2480.40  2022-10-10         5005         5003
9    70012     250.45  2022-06-27         5001         5002
10   70011      75.29  2022-08-17         5005         5007
11   70013    3045.60  2022-04-25         5005         5001

Group by two columns and count by each row:
                         0
salesman_id customer_id
5001        5001         1
            5005         3
5002        5001         2
            5005         1
5003        5001         1
            5005         1
5005        5001         1
5006        5001         1
5007        5005         1

In [11]:
print("Original Orders DataFrame:")
print(orders_data)
orders_data['ord_date']= pd.to_datetime(orders_data['ord_date']) 
print("\nYear wise Month wise purchase amount:")
result = orders_data.groupby([orders_data['ord_date'].dt.year, orders_data['ord_date'].dt.month]).agg({'purch_amt':sum})
print(result)

Original Orders DataFrame:
    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2022-10-05         5001         5002
1    70009     270.65  2022-09-10         5001         5005
2    70002      65.26  2022-10-05         5005         5001
3    70004     110.50  2022-08-17         5001         5003
4    70007     948.50  2022-09-10         5005         5002
5    70005    2400.60  2022-07-27         5001         5001
6    70008    5760.00  2022-09-10         5005         5001
7    70010    1983.43  2022-10-10         5001         5006
8    70003    2480.40  2022-10-10         5005         5003
9    70012     250.45  2022-06-27         5001         5002
10   70011      75.29  2022-08-17         5005         5007
11   70013    3045.60  2022-04-25         5005         5001

Year wise Month wise purchase amount:
                   purch_amt
ord_date ord_date
2022     4           3045.60
         6            250.45
         7           2400.60
         8            185.79
         9           6979.15
         10          4679.59

In [12]:
import pandas as pd
df = pd.DataFrame( {'id' : [1, 2, 1, 1, 2, 1, 2], 
                    'type' : [10, 15, 11, 20, 21, 12, 14], 
                    'book' : ['C','C++','Java','C','C++','Java','C++']})

print("Original DataFrame:")
print(df)
result = df.groupby(['id', 'type', 'book']).size().unstack(fill_value=0)
print("\nResult:")
print(result)

Original DataFrame:
   id  type  book
0   1    10     C
1   2    15   C++
2   1    11  Java
3   1    20     C
4   2    21   C++
5   1    12  Java
6   2    14   C++

Result:
book     C  C++  Java
id type
1  10    1    0     0
   11    0    0     1
   12    0    0     1
   20    1    0     0
2  14    0    1     0
   15    0    1     0
   21    0    1     0

In [13]:
import pandas as pd
pd.set_option('display.max_rows', None)
#pd.set_option('display.max_columns', None)
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s001'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])
print("Original DataFrame:")
print(df)
print("\nGroup by with multiple aggregations:")
result = df.groupby(['school_code','class']).agg({'height': ['max', 'mean'],
                                 'weight': ['sum','min','count']})
print(result)

Original DataFrame:
   school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35
S2        s002     V    Gino Mcneill     17/05/2002   12     192      32
S3        s003    VI     Ryan Parkes     16/02/1999   13     186      33
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30
S5        s002     V    Gino Mcneill     11/05/2002   14     151      31
S6        s001    VI    David Parkes     15/09/1997   12     159      32

    address
S1  street1
S2  street2
S3  street3
S4  street1
S5  street2
S6  street4

Group by with multiple aggregations:
                  height        weight
                     max   mean    sum min count
school_code class
s001        V        173  173.0     35  35     1
            VI       167  163.0     62  30     2
s002        V        192  171.5     63  31     2
s003        VI       186  186.0     33  33     1

In [14]:
import pandas as pd
df = pd.DataFrame( {'id' : ['A','A','B','B','B','B','C','C','C','C','C'], 
                    'type' : [1,1,1,1,2,2,1,1,1,2,2], 
                    'book' : ['C','C','C++','Java','C','C++','Java','DS','DS','DS','Java']})

print("Original DataFrame:")
print(df)
new_df = df[['id', 'type', 'book']].drop_duplicates()\
                         .groupby(['id','type'])['book']\
                         .apply(list)\
                         .reset_index()

new_df['book'] = new_df.apply(lambda x: (','.join([str(s) for s in x['book']])), axis = 1)
print("\nList all unique values in a group:")
print(new_df)

Original DataFrame:
   id  type  book
0   A     1     C
1   A     1     C
2   B     1   C++
3   B     1  Java
4   B     2     C
5   B     2   C++
6   C     1  Java
7   C     1    DS
8   C     1    DS
9   C     2    DS
10  C     2  Java

List all unique values in a group:
  id  type      book
0  A     1         C
1  B     1  C++,Java
2  B     2     C,C++
3  C     1   Java,DS
4  C     2   DS,Java